package Week3.Tasks;

/**
 * Використовуючи рекурсію, виведіть на екран задане по порядковому номеру число Фібоначі. Для вирішення завдання використовуйте шаблон:

 * Просимо врахувати деякі особливості перевірки завдань:

 * Декларація package повинна залишатися незмінною (як у шаблоні), зверніть на це увагу вставляючи Ваш код у вікно перевірки.
 * Для перевірки використовуються (беруться до уваги) виключно методи з сигнатурою описаною в шаблоні.
 * Кількість та зміст полів та/або методів відмінних від наведених в шаблоні не обмежена.
 * В кожному класі повинен бути або конструктор за замовчанням або public безаргументний конструктор.
 */

public class Task3 {

    public static void main (String[] args){
        Task3 t = new Task3();
        System.out.println(t.getNumber(28));
    }

    public long getNumber(int position){
        if (position <=0)
            return -1;
        if (position == 1)
            return 1;
        if (position == 2)
            return 1;
        return getNumber(position - 1) + getNumber(position - 2);
    }

}
