package Week6.Taks;

/**
 * Створити застосування, що упакуковуватиме рядки за допомогою алгоритму RLE.
 * У випадку Вашого застосування потрібно замінити послідовніть однакових
 * букв на букву за якою буде слідувати цифра від 2 до 9, що вкаже на кількість повтору символів.
 * Якщо символ зустрівся лише 1 раз то заміну робити не потрібно. Регістр символів при заміні враховується.
 * Наприклад, рядок:

 * Hhhhhhhhhhhhhheeeellooooo

 * Буде перетворено на:

 * Hh9h4e4l2o5

 * Зверніть увагу: якщо кількість повторів більше 9 то потрібно розбити закодовану інформацію на дві групи. Наприклад:

 * hhhhhhhhhhhh

 * буде замінено на:

 * h9h3

 * Дані для кодування будуть надходити як аргументи командного рядка (лише один рядок).
 * Зверніть увагу на перевірку вхідних даних: на вході НЕ може бути null але може бути пустий рядок.
 * У випадку пустого рядку на вході Ваше застосування повинно вивести на екран пустий рядок.
 */


public class Task1 {

    public static void main( String[] args )
    {
        StringBuilder sb = new StringBuilder();
        for (int i = 0; i < args[0].length(); i++){
            int num = 1;
            while (i + 1 < args[0].length() && args[0].charAt(i) == args[0].charAt(i + 1)){
                if (num == 9)
                {
                    break;
                }
                num++;
                i++;
            }
            sb.append(args[0].charAt(i));
            if (num > 1) {
                sb.append(num);
            }
        }
        System.out.println(sb);


    }
}
